English/NewWords/idioms.org
#+OPTIONS: ^:{} _:{} num:t toc:t \n:t
#+INCLUDE: "../../template.org"
#+SETUPFILE: "../../extension.org"
#+title:Idioms

* easier said than done
  说容易做难
* get the best/better of you
  defeat/triumph over
  #+begin_example
  If you want to be the best, don't let fear get the best of you.
  Try your best not to let the situation get the best of you.
  #+end_example
* You can't teach an old dog new tricks
  1. 老人学新东西很难
  2. 人很难改变旧的想法
  
* with a grain of salt
  "(With) a grain of salt," (or "a pinch of salt") in modern English, is an idiom which means to view something with skepticism, or to not take it literally.
  持保留/怀疑的态度地看待。
  #+begin_example
  This is why you should take the advice of one person with a grain of salt. 
  这就是为什么你要带着怀疑的态度去接受一个人的意见的原因。
  #+end_example
