English/NewWords/idioms.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>Idioms</title>
<!-- 2013-06-08 六 06:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="preamble" class="status">
<div id="org-div-comments"><a href="../../index.html#english">主页</a></div>
</div>
<div id="content">
<h1 class="title">Idioms</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. easier said than done</a></li>
<li><a href="#sec-2">2. get the best/better of you</a></li>
<li><a href="#sec-3">3. You can't teach an old dog new tricks</a></li>
<li><a href="#sec-4">4. with a grain of salt</a></li>
</ul>
</div>
</div>
<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/style.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> easier said than done</h2>
<div class="outline-text-2" id="text-1">
<p>
说容易做难<br/>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> get the best/better of you</h2>
<div class="outline-text-2" id="text-2">
<p>
defeat/triumph over<br/>
</p>
<pre class="example">
If you want to be the best, don't let fear get the best of you.
Try your best not to let the situation get the best of you.
</pre>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> You can't teach an old dog new tricks</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>老人学新东西很难<br/>
</li>
<li>人很难改变旧的想法<br/>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> with a grain of salt</h2>
<div class="outline-text-2" id="text-4">
<p>
"(With) a grain of salt," (or "a pinch of salt") in modern English, is an idiom which means to view something with skepticism, or to not take it literally.<br/>
持保留/怀疑的态度地看待。<br/>
</p>
<pre class="example">
This is why you should take the advice of one person with a grain of salt. 
这就是为什么你要带着怀疑的态度去接受一个人的意见的原因。
</pre>
</div>
</div>
</div>
</body>
</html>
